Revit 2024 API
RevitAPIPostEventArgs Members
The RevitAPIPostEventArgs type exposes the following members.
Methods
Name | Description
Dispose |  (Inherited from RevitAPIEventArgs.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsCancelled
 Indicates whether the event is being cancelled.
 (Inherited from RevitAPIEventArgs.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Cancellable
 Indicates whether an event may be cancelled by an event delegate.
 (Inherited from RevitAPIEventArgs.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from RevitAPIEventArgs.)
Status
 Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an API event handler).
See Also
RevitAPIPostEventArgs Class
Autodesk.Revit.DB.Events Namespace